"use client"
import React from 'react'
import RasiImage from '../rasiIcon/RasiImage';
import { rasiOne } from '@/datas/navbar';
import '@/styles/componentsStyles/singleRasiStyle.css';
import { Tab, Tabs, TabList, TabPanel } from 'react-tabs';
import Heading02 from '../heading/Heading02';
// import 'react-tabs/style/react-tabs.css';

const lastName = 'ராசிபலன்';

function SingleRasi(props) {
    return (
        <>
            <div className="col col-md-2 ">
                <div className=' w-100 d-flex justify-content-center gap-4 align-items-center'>
                    <div className='d-flex d-xl-block justify-content-center gap-4 align-items-center'>
                        <div className="single-rasi-parent ">
                            <RasiImage img={rasiOne.img} style={`h-75 w-75`} />
                        </div>
                    </div>
                    <form action="" className='d-md-none'>
                        <select className="form-control form-control-lg w-100
                        ">
                            {props.rasiNames.map((item, id) => (
                                <option key={id} value={id}>{item.rasiName} </option>
                            ))}
                            {/* <option value="1">மேஷம் </option>
                        <option value="2">ரிஷபம் </option>
                        <option value="3">மிதுனம் </option>
                        <option value="4">கடகம்  </option>
                        <option value="5">சிம்மம்  </option>
                        <option value="6">கன்னி  </option>
                        <option value="7">துலாம்  </option>
                        <option value="8">விருச்சிகம்</option>
                        <option value="9">தனுசு</option>
                        <option value="10">மகரம்</option>
                        <option value="11">கும்பம்</option>
                        <option value="12">மீனம்</option> */}
                        </select>
                    </form>
                </div>
            </div>

            <div className="col-md-10 ">

                <Tabs className="my-2 w-100">
                    <TabList >
                        <Tab>இன்றைய <span> {lastName} </span> </Tab>
                        <Tab>வார <span> {lastName} </span></Tab>
                        <Tab>மாத <span> {lastName} </span></Tab>
                        <Tab>வருட <span> {lastName} </span></Tab>
                    </TabList>
                    <TabPanel>
                        <div className='d-flex flex-column gap-2 align-items-center'>
                            <p className='para-1'>மீன ராசி நேயர்களே! (23-07-2024) தொழில், வியாபாரத்தில் மந்த நிலை காணப்படும். குடும்பத்தில் பிள்ளைகளால் வீண் செலவுகள் ஏற்படும். பணவரவு சுமாராக இருந்தாலும் வீட்டு தேவைகள் பூர்த்தியாகும். உடன் பிறந்தவர்கள் உதவியாக இருப்பார்கள். உத்தியோகஸ்தர்களுக்கு வேலையில் பணிச்சுமை குறையும்.</p>
                            <Heading02 title={"கிரக நிலை"} />
                            <div className="my-3 option-1-img">
                                <img src="https://d1rx9sxwt07suq.cloudfront.net/rasipalan/web_images/daily/2024_07/23_07_2024.jpg" className='img-fluid w-100 h-100' alt="keragea img" />
                            </div>
                        </div>
                    </TabPanel>
                    <TabPanel>
                        <Heading02 title={"உடல் ஆரோக்கியம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"தொழில்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"பரிகாரம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"சந்திராஷ்டமம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                    </TabPanel>
                    <TabPanel>
                        <p className='para-1'>மீன ராசி நேயர்களே! (23-07-2024) தொழில், வியாபாரத்தில் மந்த நிலை காணப்படும். குடும்பத்தில் பிள்ளைகளால் வீண் செலவுகள் ஏற்படும். பணவரவு சுமாராக இருந்தாலும் வீட்டு தேவைகள் பூர்த்தியாகும். உடன் பிறந்தவர்கள் உதவியாக இருப்பார்கள். உத்தியோகஸ்தர்களுக்கு வேலையில் பணிச்சுமை குறையும்.</p>
                        <Heading02 title={"குடும்பம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"உடல் ஆரோக்கியம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"தொழில்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"பரிகாரம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                        <Heading02 title={"சந்திராஷ்டமம்"} />
                        <p className='para-1'>உங்கள் ராசிக்கு 4, 5-ல் சுக்கிரன், 12-ஆம் தேதி முதல் 3-ல் செவ்வாய் சஞ்சரிப்பதால், நெருங்கியவர்களை அனுசரித்து சென்றால் ஒரு சில அனுகூலமான பலன்களை பெற முடியும். பணவரவுகள் ஏற்ற, இறக்கமாக இருக்கும் என்பதால் தேவையற்ற ஆடம்பர செலவுகளை தவிர்ப்பது நல்லது.</p>
                    </TabPanel>
                    <TabPanel>
                        <p className="para-1">கம்பீரமான தோற்றமும், பிறரை வசீகரிக்கக்கூடிய அழகான உடல் அமைப்பும் கொண்ட மீன ராசி நேயர்களே! குருவின் ஆதிக்கத்தில் பிறந்த நீங்கள் இயற்கையிலேயே மற்றவர்களுக்கு உதவி செய்யக்கூடிய பண்பு கொண்டவர்களாக இருப்பீர்கள். வரும் 2024-ம் ஆண்டில் பொன்னவன் என போற்றப்படக்கூடிய ராசியாதிபதி குருபகவான் உங்கள் ராசிக்கு தன ஸ்தானமான 2-ம் வீட்டில் 01-05-2024 முடிய சஞ்சாரம் செய்கின்ற காரணத்தால் வரும் ஆண்டில் முதல் நான்கு மாத காலங்கள் உங்களின் பொருளாதார நிலை மிக மிக நன்றாக இருக்கும். பணவரவுகள் சிறப்பாக இருந்து அனைத்து விதமான தேவைகளும் பூர்த்தியாவது மட்டுமில்லாமல் மங்கலகரமான சுபகாரியங்கள் கைகூடக்கூடிய ஒரு வாய்ப்புகள் உண்டு. உங்கள் எண்ணங்களை முதல் நான்கு மாதத்தில் செயல்படுத்தினால் அதற்கு முழுமையான வெற்றியினை பெறக்கூடிய வாய்ப்புகள் உண்டு. குடும்பத்தில் மங்கலகரமான சுப காரியங்கள் கைகூடக்கூடிய அதிர்ஷ்டங்கள் உண்டு. பிள்ளைகள் வழியில் ஒரு சில மகிழ்ச்சி தரக்கூடிய இனிய நிகழ்வுகள் நடக்கும்.</p>
                    </TabPanel>
                </Tabs>
            </div>

        </>
    )
}

export default SingleRasi